# ModifySubElement Method (SlabShapeCrease, Double)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SlabShapeEditor..::..ModifySubElement Method (SlabShapeCrease, Double)
SlabShapeEditor Class See Also
---
Manipulates the crease on the corresponding slab, roof or floor.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void ModifySubElement(
	SlabShapeCrease crease,
	double offset
)
```

Visual Basic
---
```text
Public Sub ModifySubElement ( _
	crease As SlabShapeCrease, _
	offset As Double _
)
```

Visual C++
---
```text
public:
void ModifySubElement(
	SlabShapeCrease^ crease,
	double offset
)
```

# ### Parameters
crease
    Type: Autodesk.Revit.DB..::..SlabShapeCreaseThe crease.
offset
    Type: System..::..DoubleThe new value of the crease offset, which is the average of offsets of its ends.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the crease is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when the crease is invalid. |

# See Also
SlabShapeEditor Class
ModifySubElement Overload
Autodesk.Revit.DB Namespace